//
//  UIView+AdditionalProperties.h
//  vk-networkLayer
//
//  Created by Uber on 17/10/2020.
//  Copyright © 2020 Mobile. All rights reserved.
//

#import <UIKit/UIKit.h>

NS_ASSUME_NONNULL_BEGIN

/*--------------------------------------------------------------------------------------------------------------
 [🔳🗜🛠] 'UIView(AdditionalProperties)' - содержит дополнительные методы и проперти которые расширяют стандартные возможности.
 --------------------------------------------------------------------------------------------------------------*/

@interface UIView (AdditionalProperties)

/*--------------------------------------------------------------------------------------------------------------
 Проперти используется в паттерне построения UI - 'LSSH'.
 Служит оно тому, чтобы единожды настроенное проперти, например мы уже задали ему 'backgroundColor', не было
 настроенно еще раз.
 В основном это используется при работе с построением ячеек таблицы.
 Чтобы subviews ячейки не проходили процесс настройки каждый раз.
 Пример:
 
 - (void) styleFor_avatarImgView:(UIImageView*)imgView vm:(WallPostCellVM*)viewModel
 {
     if (!imgView.isStylized){
         imgView.backgroundColor = [UIColor whiteColor];
         imgView.isStylized = YES;
     }
 }
 --------------------------------------------------------------------------------------------------------------*/
@property (nonatomic, assign) BOOL isStylized;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает текущею ориентацию экрана. Данный метод безопасен, его можно вызывать с background-thread
 --------------------------------------------------------------------------------------------------------------*/
+ (UIInterfaceOrientation) threadSafeStatusBarOrientation;

@end

NS_ASSUME_NONNULL_END
