//
//  NSObject+AdditionalProperties.h
//  vk-networkLayer
//
//  Created by Uber on 17/10/2020.
//  Copyright © 2020 Mobile. All rights reserved.
//

#import <Foundation/Foundation.h>

NS_ASSUME_NONNULL_BEGIN

/*--------------------------------------------------------------------------------------------------------------
 Макрос проверяющий значение проперти 'isPrintLogInConsole' и если оно равняется 'YES'.
 Тогда вызывает метод 'printMethodName', который распечатает название метода и поток с которого он был вызван.
 --------------------------------------------------------------------------------------------------------------*/
#define printMethod ([(NSObject*)self isPrintLogInConsole] ? [self printMethodName:[NSString stringWithFormat:@"%s (%p)",__PRETTY_FUNCTION__,self]] : 1);



/*--------------------------------------------------------------------------------------------------------------
 [📦🗜🛠] 'NSObject(AdditionalProperties)' - содержит дополнительные методы и проперти которые расширяют стандартные
                                             возможности всех наследников класса 'NSObject'.
 ----------------------------------------------------------------------------------------------------------------*/

@interface NSObject (AdditionalProperties)

/*--------------------------------------------------------------------------------------------------------------
 Измените значение на 'YES', и тогда при вызове макроса 'printMethod' в консоль будет выведена информация из
 какого метода,класса и потока был вызван данный макрос.
 --------------------------------------------------------------------------------------------------------------*/
@property (nonatomic, assign) BOOL isPrintLogInConsole;


/*--------------------------------------------------------------------------------------------------------------
 Возвращает адресс в памяти
 --------------------------------------------------------------------------------------------------------------*/
@property (nonatomic, strong) NSString* addressInMemory;


/*--------------------------------------------------------------------------------------------------------------
 Метод который вызывается макросом если 'isPrintLogInConsole' имеет значение 'YES'.
 Метод непосредственно печатает лог в консоль.
 --------------------------------------------------------------------------------------------------------------*/
- (void) printMethodName:(NSString*)method;


@end

NS_ASSUME_NONNULL_END
